Q1: Write a function to find the most frequent destination of a user.

In [18]:
import pandas as pd

# Sample data as list of dictionaries
data = [
    {'user_id': 'U1', 'destination': 'Delhi'},
    {'user_id': 'U2', 'destination': 'Mumbai'},
    {'user_id': 'U1', 'destination': 'Delhi'},
    {'user_id': 'U1', 'destination': 'Bangalore'},
    {'user_id': 'U2', 'destination': 'Mumbai'},
    {'user_id': 'U1', 'destination': 'Delhi'},
    {'user_id': 'U2', 'destination': 'Bangalore'},
    {'user_id': 'U3', 'destination': 'Pune'},
    {'user_id': 'U3', 'destination': 'Pune'},
    {'user_id': 'U3', 'destination': 'Delhi'}
]

# Create DataFrame
df = pd.DataFrame(data)

In [19]:
grouped = df.groupby(by = ['user_id', 'destination']).value_counts()
grouped = grouped.reset_index()

grouped['rnk'] = grouped.groupby('user_id')['count'].rank(method = 'dense', ascending = False)
grouped[grouped['rnk'] == 1]

  user_id destination  count  rnk
1      U1       Delhi      3  1.0
3      U2      Mumbai      2  1.0
5      U3        Pune      2  1.0

In [23]:
#second way
import pandas as pd

# Sample data
data = {
    'user_id': ['U1', 'U2', 'U1', 'U1', 'U2', 'U1', 'U2', 'U3', 'U3', 'U3'],
    'destination': ['Delhi', 'Mumbai', 'Delhi', 'Bangalore', 'Mumbai', 'Delhi', 'Bangalore', 'Pune', 'Pune', 'Delhi']
}

df = pd.DataFrame(data)

# Function to find most frequent destination for a user
def most_frequent_destination(df, user_id):
    user_data = df[df['user_id'] == user_id]
    if user_data.empty:
        return None
    return user_data['destination'].mode().iloc[0]

# Example usage
print(most_frequent_destination(df, 'U1'))  # Output: Delhi

Delhi

Q2: Implement a moving average for time series data.

In [41]:
import pandas as pd

# Sample time series data
data = [
    {'date': '2024-01-01', 'value': 10},
    {'date': '2024-01-02', 'value': 12},
    {'date': '2024-01-03', 'value': 15},
    {'date': '2024-01-04', 'value': 14},
    {'date': '2024-01-05', 'value': 16},
    {'date': '2024-01-06', 'value': 18},
    {'date': '2024-01-07', 'value': 20}
]

df = pd.DataFrame(data)

In [44]:
df['date'] = pd.to_datetime(df['date'])
df.set_index('date', inplace = True)

df['moving_avg_3'] = df['value'].rolling(window=2).mean()
df

            value  moving_avg_3
date
2024-01-01     10           NaN
2024-01-02     12          11.0
2024-01-03     15          13.5
2024-01-04     14          14.5
2024-01-05     16          15.0
2024-01-06     18          17.0
2024-01-07     20          19.0

Q3: Write code to remove outliers from a list using IQR.

In [46]:
data = [10, 12, 14, 15, 15, 16, 17, 18, 100]  # 100 is an outlier

import numpy as np

data = np.array(data)
q1 = np.percentile(data, 25)
q3 = np.percentile(data, 75)

IQR = q3 - q1

lower_bound = q1 - 1.5 * IQR
upper_bound = q3 + 1.5 * IQR

filtered_data = data[(data >= lower_bound) & (data <= upper_bound)]
filtered_data.tolist()

[10, 12, 14, 15, 15, 16, 17, 18]

Q4: Given timestamps of orders, find median delivery time per hour.

In [87]:
data = [
    {"order_id": 1, "order_time": "2023-06-01 10:05:00", "delivery_time": "2023-06-01 10:45:00"},
    {"order_id": 2, "order_time": "2023-06-01 10:15:00", "delivery_time": "2023-06-01 10:50:00"},
    {"order_id": 3, "order_time": "2023-06-01 11:00:00", "delivery_time": "2023-06-01 11:30:00"},
    {"order_id": 4, "order_time": "2023-06-01 11:10:00", "delivery_time": "2023-06-01 11:50:00"},
    {"order_id": 5, "order_time": "2023-06-01 11:45:00", "delivery_time": "2023-06-01 12:20:00"},
    {"order_id": 6, "order_time": "2023-06-01 12:05:00", "delivery_time": "2023-06-01 12:40:00"},
    {"order_id": 7, "order_time": "2023-06-01 12:15:00", "delivery_time": "2023-06-01 12:55:00"},
    {"order_id": 8, "order_time": "2023-06-01 13:00:00", "delivery_time": "2023-06-01 13:35:00"},
    {"order_id": 9, "order_time": "2023-06-01 13:10:00", "delivery_time": "2023-06-01 13:50:00"},
    {"order_id": 10, "order_time": "2023-06-01 13:25:00", "delivery_time": "2023-06-01 14:10:00"},
]

q4_df = pd.DataFrame(data)

In [88]:
q4_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_id       10 non-null     int64
 1   order_time     10 non-null     object
 2   delivery_time  10 non-null     object
dtypes: int64(1), object(2)
memory usage: 372.0+ bytes

In [89]:
q4_df['order_time'] = pd.to_datetime(q4_df['order_time'])
q4_df['delivery_time'] = pd.to_datetime(q4_df['delivery_time'])

q4_df['delivery_tat'] = ((q4_df['delivery_time'] - q4_df['order_time']).dt.total_seconds())/60
q4_df['order_hour'] = q4_df['order_time'].dt.hour

#calculating median tat per hour
median_tat = (
    q4_df.groupby('order_hour', as_index=False)['delivery_tat']
    .median()
    .rename(columns={'delivery_tat': 'median_delivery_tat'})
)


median_tat

   order_hour  median_delivery_tat
0          10                 37.5
1          11                 35.0
2          12                 37.5
3          13                 40.0

Q5: Given trip data, find top 3 destinations by revenue.

In [90]:
trip_data = [
    {"trip_id": 1, "user_id": "u1", "destination": "A", "revenue": 250},
    {"trip_id": 2, "user_id": "u2", "destination": "B", "revenue": 180},
    {"trip_id": 3, "user_id": "u3", "destination": "A", "revenue": 300},
    {"trip_id": 4, "user_id": "u1", "destination": "C", "revenue": 150},
    {"trip_id": 5, "user_id": "u4", "destination": "B", "revenue": 220},
    {"trip_id": 6, "user_id": "u5", "destination": "D", "revenue": 400},
    {"trip_id": 7, "user_id": "u2", "destination": "A", "revenue": 275},
    {"trip_id": 8, "user_id": "u6", "destination": "C", "revenue": 120},
    {"trip_id": 9, "user_id": "u7", "destination": "B", "revenue": 210},
    {"trip_id": 10, "user_id": "u3", "destination": "D", "revenue": 190},
]

In [108]:
trip_df = pd.DataFrame(trip_data)
top3_dest = trip_df.groupby(by = 'destination').agg(total_revenue = ('revenue', 'sum')).reset_index()
top3_dest.sort_values(by = 'total_revenue', ascending=False).head(3)

  destination  total_revenue
0           A            825
1           B            610
3           D            590

Q6: Implement a function to simulate surge pricing based on demand/supply ratio.

In [109]:
surge_data = [
    {"timestamp": "2023-06-01 08:00:00", "zone": "A", "demand": 120, "supply": 100},
    {"timestamp": "2023-06-01 08:00:00", "zone": "B", "demand": 80, "supply": 90},
    {"timestamp": "2023-06-01 08:00:00", "zone": "C", "demand": 150, "supply": 75},
    {"timestamp": "2023-06-01 09:00:00", "zone": "A", "demand": 200, "supply": 180},
    {"timestamp": "2023-06-01 09:00:00", "zone": "B", "demand": 60, "supply": 100},
    {"timestamp": "2023-06-01 09:00:00", "zone": "C", "demand": 130, "supply": 60},
    {"timestamp": "2023-06-01 10:00:00", "zone": "A", "demand": 90, "supply": 95},
    {"timestamp": "2023-06-01 10:00:00", "zone": "B", "demand": 110, "supply": 70},
    {"timestamp": "2023-06-01 10:00:00", "zone": "C", "demand": 160, "supply": 80},
]

surge_df = pd.DataFrame(surge_data)

In [115]:
def calculate_surge(demand, supply):
    if supply == 0:
        return 3.0  # cap maximum surge multiplier to avoid division by zero
    
    # gaurd rails: price should noe fall below threshold, and should not increase above a threshold
    surge_multiplier = min(3.0, max(1.0, demand/supply))
    surged_price = surge_multiplier * supply

    return surged_price


surge_df['normal_price'] = surge_df['supply']
surge_df['surged_price'] = surge_df.apply(lambda row: calculate_surge(row['demand'], row['supply']), axis=1)
surge_df

             timestamp zone  demand  supply  normal_price  surged_price
0  2023-06-01 08:00:00    A     120     100           100         120.0
1  2023-06-01 08:00:00    B      80      90            90          90.0
2  2023-06-01 08:00:00    C     150      75            75         150.0
3  2023-06-01 09:00:00    A     200     180           180         200.0
4  2023-06-01 09:00:00    B      60     100           100         100.0
5  2023-06-01 09:00:00    C     130      60            60         130.0
6  2023-06-01 10:00:00    A      90      95            95          95.0
7  2023-06-01 10:00:00    B     110      70            70         110.0
8  2023-06-01 10:00:00    C     160      80            80         160.0

Q7: Write a function to recommend restaurants based on user order history.

In [116]:
# take all those users have ordered at least 2 times
# take those restaurants where user has ordered at least 2 times or rating given is 4 start plus, is not should not be recommmended

order_data = [
    {"user_id": "u1", "restaurant_id": "r1", "order_date": "2024-12-01", "rating": 5},
    {"user_id": "u1", "restaurant_id": "r2", "order_date": "2025-01-05", "rating": 4},
    {"user_id": "u1", "restaurant_id": "r1", "order_date": "2025-02-10", "rating": 5},
    {"user_id": "u1", "restaurant_id": "r3", "order_date": "2025-03-15", "rating": 4},
    {"user_id": "u2", "restaurant_id": "r2", "order_date": "2025-01-20", "rating": 3},
    {"user_id": "u2", "restaurant_id": "r2", "order_date": "2025-02-22", "rating": 4},
    {"user_id": "u2", "restaurant_id": "r4", "order_date": "2025-03-25", "rating": 5},
    {"user_id": "u3", "restaurant_id": "r1", "order_date": "2025-04-01", "rating": 4},
    {"user_id": "u3", "restaurant_id": "r5", "order_date": "2025-04-10", "rating": 5},
    {"user_id": "u3", "restaurant_id": "r5", "order_date": "2025-05-12", "rating": 5},
    {"user_id": "u3", "restaurant_id": "r1", "order_date": "2025-05-20", "rating": 4},
    {"user_id": "u4", "restaurant_id": "r6", "order_date": "2025-06-01", "rating": 2},
    {"user_id": "u5", "restaurant_id": "r2", "order_date": "2025-04-05", "rating": 3},
    {"user_id": "u5", "restaurant_id": "r3", "order_date": "2025-05-18", "rating": 4},
    {"user_id": "u6", "restaurant_id": "r1", "order_date": "2025-06-10", "rating": 5},
    {"user_id": "u7", "restaurant_id": "r7", "order_date": "2025-05-30", "rating": 3},  # One-time user
    {"user_id": "u8", "restaurant_id": "r6", "order_date": "2025-06-12", "rating": 2},  # One-time user
]

recsys_df = pd.DataFrame(order_data)

In [117]:
recsys_df

   user_id restaurant_id  order_date  rating
0       u1            r1  2024-12-01       5
1       u1            r2  2025-01-05       4
2       u1            r1  2025-02-10       5
3       u1            r3  2025-03-15       4
4       u2            r2  2025-01-20       3
5       u2            r2  2025-02-22       4
6       u2            r4  2025-03-25       5
7       u3            r1  2025-04-01       4
8       u3            r5  2025-04-10       5
9       u3            r5  2025-05-12       5
10      u3            r1  2025-05-20       4
11      u4            r6  2025-06-01       2
12      u5            r2  2025-04-05       3
13      u5            r3  2025-05-18       4
14      u6            r1  2025-06-10       5
15      u7            r7  2025-05-30       3
16      u8            r6  2025-06-12       2

Leetcode easy questions

Data manipulation questions

In [161]:
orders_data = [
    {'order_id': 1, 'user_id': 101, 'restaurant': 'Burger Palace', 'item': 'Cheeseburger', 'price': 250, 'rating': 4, 'order_date': '2023-12-01'},
    {'order_id': 2, 'user_id': 102, 'restaurant': 'Sushi House', 'item': 'Salmon Roll', 'price': 550, 'rating': 5, 'order_date': '2023-12-02'},
    {'order_id': 3, 'user_id': 103, 'restaurant': 'Pizza Corner', 'item': 'Pepperoni Pizza', 'price': 600, 'rating': 3, 'order_date': '2023-12-03'},
    {'order_id': 4, 'user_id': 101, 'restaurant': 'Burger Palace', 'item': 'Veggie Burger', 'price': 200, 'rating': 4, 'order_date': '2023-12-04'},
    {'order_id': 5, 'user_id': 104, 'restaurant': 'Taco Town', 'item': 'Beef Taco', 'price': 300, 'rating': 5, 'order_date': '2023-12-05'},
    {'order_id': 6, 'user_id': 102, 'restaurant': 'Sushi House', 'item': 'Tuna Roll', 'price': 520, 'rating': 4, 'order_date': '2023-12-05'},
    {'order_id': 7, 'user_id': 105, 'restaurant': 'Pizza Corner', 'item': 'Margherita Pizza', 'price': 450, 'rating': 2, 'order_date': '2023-12-06'},
    {'order_id': 8, 'user_id': 101, 'restaurant': 'Taco Town', 'item': 'Chicken Taco', 'price': 280, 'rating': 3, 'order_date': '2023-12-06'},
    {'order_id': 9, 'user_id': 106, 'restaurant': 'Burger Palace', 'item': 'Chicken Burger', 'price': 270, 'rating': 5, 'order_date': '2023-12-07'},
    {'order_id': 10, 'user_id': 107, 'restaurant': 'Sushi House', 'item': 'Eel Roll', 'price': 580, 'rating': 4, 'order_date': '2023-12-07'},
    {'order_id': 11, 'user_id': 107, 'restaurant': 'Sushi House', 'item': 'Eel Roll', 'price': 580, 'rating': 4, 'order_date': '2023-12-07'},

]

In [162]:
df = pd.DataFrame(orders_data)

In [136]:
# average and total order value by each user and restaurant
result = df.groupby(['user_id', 'restaurant']).agg(avg_price = ('price', 'mean'),
                                          total_price = ('price', 'sum'))

result.reset_index(inplace=True)

result

   user_id     restaurant  avg_price  total_price
0      101  Burger Palace      225.0          450
1      101      Taco Town      280.0          280
2      102    Sushi House      535.0         1070
3      103   Pizza Corner      600.0          600
4      104      Taco Town      300.0          300
5      105   Pizza Corner      450.0          450
6      106  Burger Palace      270.0          270
7      107    Sushi House      580.0          580

In [139]:
# Total orders by each user

result = df.groupby('user_id').agg(top_order_value = ('price', 'max'))
result.reset_index(inplace = True)
# result

new_df = df.merge(result, how = 'inner', left_on = ['user_id', 'price'], right_on= ['user_id', 'top_order_value'])
new_df

,order_id,user_id,restaurant,item,price,rating,order_date,top_order_value
0,2,102,Sushi House,Salmon Roll,550,5,2023-12-02,550
1,3,103,Pizza Corner,Pepperoni Pizza,600,3,2023-12-03,600
2,5,104,Taco Town,Beef Taco,300,5,2023-12-05,300
3,7,105,Pizza Corner,Margherita Pizza,450,2,2023-12-06,450
4,8,101,Taco Town,Chicken Taco,280,3,2023-12-06,280
5,9,106,Burger Palace,Chicken Burger,270,5,2023-12-07,270
6,10,107,Sushi House,Eel Roll,580,4,2023-12-07,580

In [154]:
# Top 3 restaurants by revenue

result = df.groupby('restaurant').agg(revenue = ('price', 'sum'))
result.reset_index(inplace=True)

result.sort_values(by='revenue', ascending=False, inplace=True)
result.head(3)

      restaurant  revenue
2    Sushi House     1650
1   Pizza Corner     1050
0  Burger Palace      720

In [156]:
# Average rating per restaurant

result = df.groupby('restaurant').agg(avg_rating = ('rating', 'mean'))
result.reset_index(inplace = True)

result['avg_rating'] = result['avg_rating'].round(1)
result

      restaurant  avg_rating
0  Burger Palace         4.3
1   Pizza Corner         2.5
2    Sushi House         4.3
3      Taco Town         4.0

In [165]:
# Most ordered item

result = df.groupby('item').agg(order_counts = ('order_id', 'count'))
result.reset_index(inplace = True)

result[result['order_counts'] == result['order_counts'].max()]

       item  order_counts
4  Eel Roll             2

In [166]:
result[result['order_counts'] == result['order_counts'].min()]

               item  order_counts
0         Beef Taco             1
1      Cheeseburger             1
2    Chicken Burger             1
3      Chicken Taco             1
5  Margherita Pizza             1
6   Pepperoni Pizza             1
7       Salmon Roll             1
8         Tuna Roll             1
9     Veggie Burger             1

In [ ]:
# Orders in December after 5th

df['order_date'] = pd.to_datetime(df['order_date'])
df[(df['order_date'].dt.day >= 5) & (df['order_date'].dt.month == 12)]

,order_id,user_id,restaurant,item,price,rating,order_date
4,5,104,Taco Town,Beef Taco,300,5,2023-12-05
5,6,102,Sushi House,Tuna Roll,520,4,2023-12-05
6,7,105,Pizza Corner,Margherita Pizza,450,2,2023-12-06
7,8,101,Taco Town,Chicken Taco,280,3,2023-12-06
8,9,106,Burger Palace,Chicken Burger,270,5,2023-12-07
9,10,107,Sushi House,Eel Roll,580,4,2023-12-07
10,11,107,Sushi House,Eel Roll,580,4,2023-12-07

In [ ]:
# User who spent the most

result = df.groupby('user_id').agg(total_spend = ('price', 'sum'))
result.reset_index(inplace=True)

result.sort_values(by = 'total_spend', ascending=False, inplace=True)
result.head(1)  #result.iloc[0]

   user_id  total_spend
6      107         1160

In [189]:
# Rating trend over time

result = df.groupby('order_date').agg(avg_rating = ('rating', 'mean'))
result.reset_index(inplace = True)

result['avg_rating'] = result['avg_rating'].round(1)
result.round()

  order_date  avg_rating
0 2023-12-01         4.0
1 2023-12-02         5.0
2 2023-12-03         3.0
3 2023-12-04         4.0
4 2023-12-05         4.0
5 2023-12-06         2.0
6 2023-12-07         4.0

In [194]:
# Day with maximum orders

result = df.groupby('order_date').agg(total_orders = ('order_id', 'count'))
result.reset_index(inplace=True)

max_order = result['total_orders'].max()
result[result['total_orders'] == max_order]

  order_date  total_orders
6 2023-12-07             3

In [ ]:
# Pivot table with restaurant vs total price

result =